{"/about":{"title":"About:","data":{"":"The Bioinformatics Core at NYUAD CGSB provides computational infrastructure and\nservices for sequence analysis in support of a wide range of research projects.\nThe team develops analytical pipelines, joint genomics resources, training programs, data policies, and handles data management.","the-team#The Team":"","researchers#Researchers":""}},"/quickstart/deseq2":{"title":"Deseq2","data":{"deseq2-shiny#Deseq2 Shiny":"This Shiny app is a wrapper around Deseq2, an R package for differential gene expression analysis based on the negative binomial distribution.It is meant to provide an intuitive interface for researchers to easily upload, analyze, visualize, and explore RNAseq count data interactively with no prior programming knowledge in R.This tool supports simple or multi-factorial experimental design. It also allows for exploratory analysis when no replicates are available.The app also provides svaseq Surrogate Variable Analysis for hidden batch effect detection. The user can then include Surrogate Variables (SVs) as adjustment factors for downstream analysis (eg. differential expression).For more information on svaseq, go to this linkFor details on how this package is used for RNASeq count data analysis and visualization, see documentation","input-data-ttypes#Input Data Ttypes":"The input file is a CSV file containing a raw gene count matrix generated by\nGeneCountMerger. You have the choice to either begin transcriptome analysis\ndirectly from this point or resume from the previous processing step with\nGeneCountMerger. If you've stored the count matrix with Ensemble IDs and gene names,\nyou can select the gene IDS and Gene Symbol option when uploading your data.","gene-counts-table#Gene Counts Table":"After uploading the file, you will be able to view the matrix you uploaded.\nIf there are any duplicate names, they will be indicated with an ID appended to them,\nas highlighted in a red-colored message. For your convenience,\nthese duplicate names are displayed separately.","run-deseq2#Run deseq2":"","init-deseq2#Init deseq2":"To run deseq2 you must first specify the design formula, for more information about\nthe design formula click here.Click on ‘Initial DEseq2 to proceed’","surrogate-variable-analysis-sva#Surrogate Variable analysis (SVA)":"After initialization parameters for deseq2 to run its optional to run Surrogate Variable\nanalysis (SVA).","deseq2-results#Deseq2 results":"Result of desq2 can be analysied by exploring newly from newly added tabs\nVST\nDE result\nGene BoxPlot\nAnd Heatmap\nVolcano plot(Will be shown after the post anlysis of DE result)\nVenn diagram(Will be shown after the post anlysis of DE result)","visualization#Visualization":"Various forms of visualizations are included"}},"/applications/data_preprocessing_and_qc/gene_count_merger":{"title":"Gene Count Merger","data":{"gene-count-merger#Gene Count Merger":"This is a simple preprocessing tool to merge individual gene count files (Eg. output count files from htseq)NOTE: first column must contain the genes. If the gene columns do not match in all files, this tool will not work"}},"/applications/data_preprocessing_and_qc/merge_fpkms":{"title":"Merge Fpkms","data":{"gene-count-merger#Gene Count Merger":"This is a simple preprocessing tool to merge individual gene FPKM files (Eg. fpkm files from cufflinks)NOTE: first column must contain the genes. If the gene columns do not match in all files, this tool will not work"}},"/applications/epigenetics/bulk/atacseq_qc":{"title":"Atacseq Qc","data":{"atacseqqc#ATACseqQC":"ATACseqQC is  tool specifically designed for the quality control (QC)\nanalysis of ATAC-seq (Assay for Transposase-Accessible Chromatin using sequencing) data.\nIt offers a range of functions and metrics to assess the quality and reliability of\nATAC-seq experiments. ATAC-seq is a powerful technique used to study chromatin accessibility,\nwhich provides insights into the regulatory regions of the genome.Key features of ATACseqQC include:\nBasic statistics summarizing the data, such as read counts and fragment length distributions.\nAssessment of fragment size distribution, PCR amplification biases, and potential PCR duplicates.\nEvaluation of GC content bias and nucleosome positioning analysis.\nCalculation of signal-to-noise ratio and fragment enrichment in specific genomic regions."}},"/applications/rna_seq/bulk_rna/debrowser":{"title":"Debrowser","data":{"debrowser#DEBrowser":"DEBrowser is a flexible, intuitive, web-based analysis platform that enables an iterative and\ninteractive analysis of count data without any requirement of programming knowledge.\nFor more information click here"}},"/applications/meta_genomics/dada2":{"title":"Dada2","data":{"dada2#DADA2":"DADA2 for modeling and correcting Illumina-sequenced amplicon errors"}},"/applications/meta_genomics/animalcules":{"title":"Animalcules","data":{"animalcules#Animalcules":"Animalcules is an interactive R Shiny application for utilizing up-to-date data analytics, visualization methods,\nand machine learning models to provide users an easy-to-use interactive microbiome analysis framework."}},"/applications/rna_seq/bulk_rna/startapp":{"title":"Startapp","data":{"startapp#StartApp":"A web-based RNAseq analysis and visualization resource."}},"/applications/rna_seq/single_cell/monocle3":{"title":"Monocle3","data":{"monocle3#Monocle3":"Monocle 3 is a computational tool for analyzing single-cell RNA sequencing (scRNA-seq) data,\nspecializing in inferring dynamic biological processes such as cell differentiation.\nIt reconstructs developmental trajectories, calculates pseudotime, identifies differentially\nexpressed genes, and offers visualization tools. Monocle 3 is widely used in research fields\nlike developmental biology and cancer biology to study cell fate decisions and gene regulatory\nnetworks at the single-cell level.For more information\nclick here"}},"/applications/rna_seq/bulk_rna/enrichment":{"title":"Enrichment","data":{"gene-enrichment-tools#Gene Enrichment Tools":"","clusterprofshinygsea-gene-set-enrichment-analysis#ClusterProfShinyGSEA (Gene Set Enrichment Analysis)":"A web-based application to perform Gene Set Enrichment Analysis (GSEA) using clusterProfiler and shiny R libraries\nThis is based on clusterProfiler R package","clusterprofshinygsea#ClusterProfShinyGSEA":"ClusterProfShinyORA (Over-Representation Analysis)\nA web-based application to perform Over-Representation Analysis (ORA) using clusterProfiler and shiny R libraries\nThis is based on clusterProfiler R package"}},"/applications/rna_seq/bulk_rna/deseq2":{"title":"Deseq2","data":{"deseq2-app#DEseq2 App":"This Shiny app is a wrapper around DESeq2, an R package for “Differential gene expression analysis based on the negative binomial distribution”"}},"/quickstart":{"title":"Nasqar Quick Start Tutorial","data":{"":"This tutorial offers insights into NASQAR, a cutting-edge web-based platform designed\nto enhance the analysis and visualization of high-throughput sequencing data, with a\nfocus on bioinformatics. NASQAR boasts a user-friendly interface conducive to interactive\ndata exploration, integrating a wide range of commonly used tools for tasks like\nTranscriptome Data Preprocessing, RNAseq Analysis (including Single-cell RNAseq),\nMetagenomics, and Gene Enrichment. By providing easy access to these powerful analysis tools,\nNASQAR aims to alleviate the computational challenges faced by researchers, enabling them to\neffectively analyze and interpret their sequencing data."}},"/applications/rna_seq/single_cell/seuartV5":{"title":"Seuartv5","data":{"seuart-v5-app#Seuart V5 App":"Seurat is an R package designed for QC, analysis, and exploration of single-cell\nRNA-seq data. Seurat aims to enable users to identify and interpret sources of\nheterogeneity from single-cell transcriptomic measurements, and to integrate diverse types of single-cell data."}},"/quickstart/Installation":{"title":"Installation","data":{"installation#Installation":"You can install NASQA2 in any plaforms","docker-based-installation#Docker Based Installation":"Docker based installation procedure allows you seamlessly install NASQAR across different plaforms.","install-docker#Install Docker":"Prerequisite: Docker (version >= 17.03.0-ce)You can install the latest version of Docker from  here","run-docker-image-from-a-remote-repository-faster#Run Docker Image from a Remote Repository (Faster)":"We have prebuild images stored in github repositry for easy InstallationTo run NASQAR locally on port 80, use the following docker command:\ndocker run -p 80:3232 nyuadcorebio/nasqarall:nasqar\nTo run NASQAR locally on a different port (e.g. port 8083), use:\ndocker run -p 8083:3232 nyuadcorebio/nasqarall:nasqar","run-docker-image-locally-from-source#Run Docker Image Locally from Source:":"","clone-nasqar2-reposity#Clone Nasqar2 reposity":"Build Docker Image:\nNavigate to the directory containing your Dockerfile and run the docker build command to build the Docker image.\ndocker build -t image_name .\nReplace image_name with the desired name for your Docker image.\nRun Docker Container:\nUse the docker run command to run a container from the locally built Docker image.\ndocker run image_name\nReplace image_name with","run-individual-application#Run individual application":"","install-anaconda#Install Anaconda":"Create conda virtual environemnt:\nconda install -c bioconda -c conda-forge mamba -y\nmamba env create -f environment.yaml\nRun Indvidual Application\nR -e \"shiny::runApp('avoApp', port = 9000, host = '0.0.0.0')\"\nAccess via web-browser on http://localhost/ or http://localhost:8083/ depending on port number used.\nNo support support Apple M* chips"}},"/":{"title":"Overview","data":{"":"Welcome to our platform! Here, we offer a diverse range of web-based Bioinformatics analysis and visualization applications. Whether you prefer running apps online or downloading them to run on your local machine, we provide both options.The field of high-throughput sequencing is continually evolving, resulting in a rapid increase in both the quantity and diversity of sequence-based data. This growth necessitates the development of new software libraries and tools for effective data analysis and visualization. However, utilizing these tools often requires computational skills beyond the expertise of the average researcher.To address this challenge, we introduce NASQAR, a dynamic web-based platform designed to lower the computational barrier. NASQAR features an intuitive interface that enables users to easily and efficiently explore their data interactively. Our platform integrates popular tools tailored for various applications, including Transcriptome Data Preprocessing, RNAseq Analysis (including Single-cell RNAseq), Metagenomics, and Gene Enrichment. Explore your data seamlessly and unlock insights with NASQAR.","citation#Citation":"When incorporating any of the apps from our portal into a publication, kindly ensure to include the proper citation for NASQAR, as detailed below:\nAdditionally, please remember to include the appropriate citation for the open-source apps hosted on our platform, which are prominently displayed on the individual app pages or GitHub repositories.","nasqar2-updates#NASQAR2 Updates:":"R version: 4.2.3GeneCountMerger:\nAdded Wormbase ID to SYMBOL mapping.\nDEseq2shiny:\nVolcano plot\nVenn Diagram\nInput data now takes gene.id and gene.name together with Gene count data\nClusterProfShinyORA:\nSelective selection of interested pathways for plotting\nThese updates bring exciting new features and improvements to NASAQ2, enhancing its capabilities and usability.","data-privacy#Data Privacy":"Although data uploaded for analysis on the online instance of\nNASQAR (at http://nasqar.abudhabi.nyu.edu/) is by default discarded after a users session ends, this does not guarantee total data privacy. In cases where data privacy is a concern (e.g. patient or pilot data), it is recommended that NASQAR is deployed on a local intranet for private users, or on a personal computer. A Docker image of NASQAR is publicly available through DockerHub and can be used to deploy the application seamlessly on any system with Docker installed, whether a local computer, a public internet server, or a private server (e.g. research institutions intranet)."}}}